Revit 2027 API
EnergyDataSettings.PercentageGlazing Property
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PercentageGlazing { get; set; }
Public Property PercentageGlazing As Double
	Get
	Set
public:
property double PercentageGlazing {
	double get ();
	void set (double value);
}
member PercentageGlazing : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The percentage glazing value is not between 0.00 and 0.95.
Remarks
 This value is used to automatically model glazed openings for masses when the Energy Analytical model is being created.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace